Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl
The Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl class represents a radio button.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.internalControl
The internal control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.#ctor(System.String,System.Drawing.Image,System.String)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl class.
text: The text.
image: The image.
group: The group.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl class.
group: The group.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.#ctor(System.String,System.String)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl class.
text: The text.
group: The group.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.#ctor(System.Drawing.Image,System.String)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl class.
image: The image.
group: The group.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.Group
Gets or sets the group.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.IsChecked
Gets or sets the checked value.
Indicates wheter the radio button has been checked.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.StateChanged
Event to be called when the state of the control has changed.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.InternalControl


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.RadioButtonControl.OnStateChanged(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the state changed event.
control: The control.